{ "facts": [ "Contrary to popular belief, the nine-banded armadillo can not roll itself into a ball to escape predators!! Only one of the twenty-odd varieties of armadillos — the three-banded armadillo (Tolypeutes tricinctus) — is able to roll up. The other types are covered with too many bony plates to allow them to curl up. Other armadillos have to rely on their armored shells for defense while they scuttle away through thick, thorny brush or dig themselves a hole to hide in.",
"Armadillos are not blind, but they do have poor eyesight. They rely on their ears and noses more than their eyes to detect food or predators. (When your food is never farther away than the end of your tongue, you don’t really need spectacular vision to find it, do you?) If you are close to an armadillo, and you stay quiet and stand still, the chances of it not noticing you are there are fairly good.",
"Nine-banded armadillos always give birth to four identical young — the only mammal known to do so. All four young develop from the same egg — and they even share the same placenta.",
"Armadillos are used in leprosy research because their body temperatures are low enough for them to contract the most virulent form of the disease. They also do not have a very strong immune system, making them an ideal model for many types of medical research.",
"Some female armadillos being used for research have given birth to young long after they were captured. These “virgin births” are a result of the female’s ability to delay implantation of the fertilized egg during times of stress. While some anecdotal cases have suggested delays of up to two years, this has never been proven. Currently, published studies have confirmed that armadillos can delay implantation for at least four months. This reproductive tactic is one reason why the armadillos are so good at colonizing new areas (such as the United States).", 
"Armadillos like to swim, and they are very good at it. They have a strong dog paddle, and can even go quite a distance underwater, walking along the bottom of streams and ponds. They can hold their breath for four to six minutes at a time. When they need to cross larger bodies of water, they swim across. Because their heavy shell makes it hard for them to float, they gulp air into their intestines to make them more buoyant. The ability to cross streams and rivers has helped armadillos expand their home range.",
"Armadillo teeth have no enamel (the hard outer covering of the tooth). They also have very few teeth — just several peg-like molars. Since they primarily eat insects, they don’t have to do a lot of heavy chewing, making big, strong teeth a waste of energy to grow.",
"Like most insect eating mammals, armadillos have a very long, sticky tongue to slurp up bugs as quickly as possible. They also are equipped with strong claws to tear open ant nests. Their cousins, the anteaters, have very similar tongues and claws.",
"Armadillos have a very low metabolic rate, which means they don’t produce much body heat. This also means that they are not good at living in cold areas, because they can’t keep warm very well! Armadillos don’t have a lot of body fat, so they must forage for food on a daily basis. Just a few cold days in a row can be deadly to an armadillo. Despite this fact, armadillos are steadily moving north.",
"One way that armadillos conserve energy is through reta mirabila (Latin for “miraculous net”) — a system of veins and arteries in their legs. Hot blood going out through arteries is cooled by cold blood coming in through veins, and vice versa. This means that not much heat actually goes out into the legs, keeping it in the body. This also means they will get frostbitten very easily, since they have no way to warm their extremities through blood flow. Marine mammals, like whales, use a similar net of veins and arteries to stop the loss of body heat through the fins.",
"Baby armadillos have soft shells, like human fingernails. They get harder as the animal grows, depositing bone under the skin to make a solid shell. The process of laying down bone is known as “ossification”.",
"If you are thinking about a pet armadillo, you had better check with your local authorities first. According to the Department of Inland Fisheries and Wildlife, it is illegal to own an armadillo in the state of Maine. Hawaii has strict regulations against the import of any foreign animal, including armadillos. The state of Montana classifies them as livestock, and regulates their import accordingly. Many states do not allow the private ownership of any wild animals without a license. Note that this applies to “rescued” armadillos as well. If you find an abandoned or injured animal, you should take it to a licensed wildlife rehabilitation center.",
"According to records kept by www.MovingHere.org.uk: On Wednesday, July 31, 1728, His Majesty George II, King of England, was presented with an armadillo as a gift. This so-called “Indian Monster” was kept happy by supplying it with “Eggs very hard boil’d”.",
"In many parts of the world, including the United States, you might find armadillo meat on the menu. During the Great Depression of the 1920s, armadillos were nicknamed 'Hoover Hogs' by the people who ate them. The name was a bitter jab at President Herbert Hoover, who had promised 'a chicken in every pot' but had instead presided over a collapse of the US economy following World War I.",
"Armadillos really dislike programming in javascript",
"Armadillos can be summoned by playing the song of their speices, “Slide” by the Goo Goo Dolls",
"Armadillos approve changes with a quickness.",
"Armadillos like the color purple, both the color and the movie.",
"Armadiillos are not very good at spelling, but they are good public speaking.",
"In some cultures, giving an Armadillo egg as a gift is a sign of good luck."


] }
